import IMG1 from "public/assets/me/IMG_72CC83C4CCF6-1.png";
import IMG2 from "public/assets/me/IMG_1361.jpg";
import IMG3 from "public/assets/me/IMG_0123.png";
import IMG4 from "public/assets/me/IMG_1263.png";
import IMG5 from "public/assets/me/IMG_1364.png";
import IMG6 from "public/assets/me/IMG_0793.png";

const processData = [
  {
    id: 1,
    image: IMG1,
    time: "2014.11",
    title: "IT に興味を示す",
    text: "母親が2014年にiPhone6を買ってきました。当時テレビでiPhoneのニュースを見てもこんなちっちゃい物が何に役に立つのだろうって思っていた当時の僕は、実際に見て触ってみると常識が覆され感動しました。その時にこんなすごいものを作ってみたいとITに興味を持ちました。",
    class: "",
  },
  {
    id: 2,
    image: IMG2,
    time: "2016.4",
    title: "自分のiPhoneを手に入れる",
    text: "その時は高校生だったのですが、こんなすごいものを作ったスティーブ・ジョブズに憧れて名前のリクにかけて「将来RikuPhoneを作って売るんだ!」とみんなに本気で言っていました。その時にITについて調べていくうちに携帯を作るというよりもエンジニアの方に興味を持ちました。",
    // class:{classes.timeline__inverted},
  },
  {
    id: 3,
    image: IMG3,
    time: "2020.4",
    title: "Webを学び始める",
    text: "大学ではITを専門的に学べるところに入ろうと思い、デジタルハリウッド大学に入学しました。そこでwebを勉強してみて、フロントエンジニアに惹かれました。特に惹かれたのは他のエンジニアに比べてユーザーとの距離が近いという点です。フロントエンドエンジニアは、ブラウザやUIなどユーザーが直接見て操作する部分を設計・構築するので、ユーザーに最大限配慮した設計が求められます。そのため、他のエンジニアに比べて、よりユーザーとの距離を近く感じることができ、自分の書いたコードがカタチとして目に見えやすい所にとても惹かれました。人のために頑張ることが好きで相手目線で物事を考えることが多い僕は向いているなと思いました。",
  },
  {
    id: 4,
    image: IMG4,
    time: "2021.4",
    title: "初めてWebサイトを世に公開する",
    text: "祖父母がいる九州まで行き、レイアウトや内容などどのようなサイトにしたいか相談しました。大学でWebの基礎を学んだはいいもののいざやってみるとわからないことだらけでした。つまづいた時に最初はうまい検索の仕方がわかりませんでしたが、トライアンドエラーを繰り返すうちに徐々に検索力が身につき公開までやり遂げることができました。今思うとずっと手探り状態でやっていたなと思いましたが様々なことを学べてとても良い経験になりました。",
  },
  {
    id: 5,
    image: IMG5,
    time: "2022.3",
    title: "エンジニアになると決意する",
    text: "サイトを制作して「サイトを見てお客さんが来てくれたよ!」と僕に感謝してくれた時は自分でも人の役に立てるんだと嬉しさを感じました。それに僕が子供の頃に感動したITを通じて、多くの人の生活を今より豊かにしたいと思いエンジニアになろうと決意しました。",
  },
  {
    id: 6,
    image: IMG6,
    time: "2022~",
    title: "Webサイト,アプリ制作経験を重ねる",
    text: "近頃はホームページ、LP、ブログなどSEO対策や高速レンダリングに最適なモダンReactフレームワークのNext.jsを習得しこのポートフォリオサイトを制作しました。またどのサイト・アプリケーション開発の現場でも必須になっているTypescriptを積極的に自分のサービスに取り込み、今後現場で不便のないように勉強しています。現在は規模の大きめのアプリケーションを開発中です。",
  },
];

export default processData;
